"""example 1"""
"""
Очень часто люди в своих сообщениях не ставят заглавные буквы, особенно это стало массовым явлением в эру мобильных устройств. 
Разработайте функцию capital_text, которая будет принимать на вход строку с текстом и возвращать строку с 
восстановленными заглавными буквами.

Функция должна:

сделать заглавной первую букву в строке, несмотря на пробелы
сделать заглавной первую букву после точки, несмотря на пробелы
сделать заглавной первую букву после восклицательного знака, несмотря на пробелы
сделать заглавной первую букву после вопросительного знака, несмотря на пробелы
"""

"""
Бачу багато хто намагається вирішити цю задачу регуляркою, але є більш простіший спосіб
Завести змінну наприклад result_string = "" - це буде наша нова строка
Завести змінну булевого типу, наприклад sign=True -це флаг, який каже що треба наступний символ строки почати з великої літери. 
На початку речення він завжди True
Запустити цикл по кожному елементу вхідної строки наприклад for ch in s
На кожній ітерації зробити перевірки
Спочатку перевіряти чи є це елемент знаком після якого треба починати речення з великої літери, тобто if ch in "!?." 
- якщо умова пройшла то встановлювати флаг в положення True  та звісно додавати цей елемент в нашу вихідну строку result_string
Потім перевіряти якщо елемент не є елементом знаку пробілу, крапки коми і так далі, тобто ch not in "!?. "   
та флаг стоїть в положенні True  - то це значить що цей елемент треба зробити в верхньому регистрі та додати до строки result_string
Також тут не забудьте про наш флаг, його вже треба встановити в положення False
Ну і якщо жодна перевірка не спрацювала - то просто цей елемент додаємо в вихідну строку
Таким чином ми переберемо весь текст та знайдемо симовли які треба зробити в верхньому регистрі
"""

s = "hello world, python is awesome! are you agree? yes, i am"


def capital_text(s):
    result_lst = []
    sing = True
    for ch in s:
        if ch in [".", "!", "?"]:
            sing = True
            result_lst.append(ch)
        elif ch not in (" ", ".", "!", "?") and sing is True:
            result_lst.append(ch.upper())
            sing = False
        else:
            result_lst.append(ch)
    return "".join(result_lst)


print(capital_text(s))